Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxPort_PinMap_TC38x_516.c
const IfxPort_Pin *IfxPort_Pin_pinTable[IFXPORT_PINMAP_NUM_MODULES][IFXPORT_PINMAP_PIN_NUM_ITEMS] = {
    {
        &IfxPort_P00_0,
        &IfxPort_P00_1,
        &IfxPort_P00_2,
        &IfxPort_P00_3,
        &IfxPort_P00_4,
        &IfxPort_P00_5,
        &IfxPort_P00_6,
        &IfxPort_P00_7,
        &IfxPort_P00_8,
        &IfxPort_P00_9,
        &IfxPort_P00_10,
        &IfxPort_P00_11,
        &IfxPort_P00_12,
        &IfxPort_P00_13,
        &IfxPort_P00_14,
        &IfxPort_P00_15
    },
    {
        &IfxPort_P01_0,
        &IfxPort_P01_1,
        &IfxPort_P01_2,
        &IfxPort_P01_3,
        &IfxPort_P01_4,
        &IfxPort_P01_5,
        &IfxPort_P01_6,
        &IfxPort_P01_7,
        &IfxPort_P01_8,
        &IfxPort_P01_9,
        &IfxPort_P01_10,
        &IfxPort_P01_11,
        &IfxPort_P01_12,
        &IfxPort_P01_13,
        &IfxPort_P01_14,
        &IfxPort_P01_15
    },
    {
        &IfxPort_P02_0,
        &IfxPort_P02_1,
        &IfxPort_P02_2,
        &IfxPort_P02_3,
        &IfxPort_P02_4,
        &IfxPort_P02_5,
        &IfxPort_P02_6,
        &IfxPort_P02_7,
        &IfxPort_P02_8,
        &IfxPort_P02_9,
        &IfxPort_P02_10,
        &IfxPort_P02_11,
        &IfxPort_P02_12,
        &IfxPort_P02_13,
        &IfxPort_P02_14,
        &IfxPort_P02_15
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P10_0,
        &IfxPort_P10_1,
        &IfxPort_P10_2,
        &IfxPort_P10_3,
        &IfxPort_P10_4,
        &IfxPort_P10_5,
        &IfxPort_P10_6,
        &IfxPort_P10_7,
        &IfxPort_P10_8,
        &IfxPort_P10_9,
        &IfxPort_P10_10,
        &IfxPort_P10_11,
        NULL_PTR,
        &IfxPort_P10_13,
        &IfxPort_P10_14,
        &IfxPort_P10_15
    },
    {
        &IfxPort_P11_0,
        &IfxPort_P11_1,
        &IfxPort_P11_2,
        &IfxPort_P11_3,
        &IfxPort_P11_4,
        &IfxPort_P11_5,
        &IfxPort_P11_6,
        &IfxPort_P11_7,
        &IfxPort_P11_8,
        &IfxPort_P11_9,
        &IfxPort_P11_10,
        &IfxPort_P11_11,
        &IfxPort_P11_12,
        &IfxPort_P11_13,
        &IfxPort_P11_14,
        &IfxPort_P11_15
    },
    {
        &IfxPort_P12_0,
        &IfxPort_P12_1,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P13_0,
        &IfxPort_P13_1,
        &IfxPort_P13_2,
        &IfxPort_P13_3,
        &IfxPort_P13_4,
        &IfxPort_P13_5,
        &IfxPort_P13_6,
        &IfxPort_P13_7,
        NULL_PTR,
        &IfxPort_P13_9,
        &IfxPort_P13_10,
        &IfxPort_P13_11,
        &IfxPort_P13_12,
        &IfxPort_P13_13,
        &IfxPort_P13_14,
        &IfxPort_P13_15
    },
    {
        &IfxPort_P14_0,
        &IfxPort_P14_1,
        &IfxPort_P14_2,
        &IfxPort_P14_3,
        &IfxPort_P14_4,
        &IfxPort_P14_5,
        &IfxPort_P14_6,
        &IfxPort_P14_7,
        &IfxPort_P14_8,
        &IfxPort_P14_9,
        &IfxPort_P14_10,
        &IfxPort_P14_11,
        &IfxPort_P14_12,
        &IfxPort_P14_13,
        &IfxPort_P14_14,
        &IfxPort_P14_15
    },
    {
        &IfxPort_P15_0,
        &IfxPort_P15_1,
        &IfxPort_P15_2,
        &IfxPort_P15_3,
        &IfxPort_P15_4,
        &IfxPort_P15_5,
        &IfxPort_P15_6,
        &IfxPort_P15_7,
        &IfxPort_P15_8,
        NULL_PTR,
        &IfxPort_P15_10,
        &IfxPort_P15_11,
        &IfxPort_P15_12,
        &IfxPort_P15_13,
        &IfxPort_P15_14,
        &IfxPort_P15_15
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P20_0,
        &IfxPort_P20_1,
        NULL_PTR,
        &IfxPort_P20_3,
        NULL_PTR,
        NULL_PTR,
        &IfxPort_P20_6,
        &IfxPort_P20_7,
        &IfxPort_P20_8,
        &IfxPort_P20_9,
        &IfxPort_P20_10,
        &IfxPort_P20_11,
        &IfxPort_P20_12,
        &IfxPort_P20_13,
        &IfxPort_P20_14,
        NULL_PTR
    },
    {
        &IfxPort_P21_0,
        &IfxPort_P21_1,
        &IfxPort_P21_2,
        &IfxPort_P21_3,
        &IfxPort_P21_4,
        &IfxPort_P21_5,
        &IfxPort_P21_6,
        &IfxPort_P21_7,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P22_0,
        &IfxPort_P22_1,
        &IfxPort_P22_2,
        &IfxPort_P22_3,
        &IfxPort_P22_4,
        &IfxPort_P22_5,
        &IfxPort_P22_6,
        &IfxPort_P22_7,
        &IfxPort_P22_8,
        &IfxPort_P22_9,
        &IfxPort_P22_10,
        &IfxPort_P22_11,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P23_0,
        &IfxPort_P23_1,
        &IfxPort_P23_2,
        &IfxPort_P23_3,
        &IfxPort_P23_4,
        &IfxPort_P23_5,
        &IfxPort_P23_6,
        &IfxPort_P23_7,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P24_0,
        &IfxPort_P24_1,
        &IfxPort_P24_2,
        &IfxPort_P24_3,
        &IfxPort_P24_4,
        &IfxPort_P24_5,
        &IfxPort_P24_6,
        &IfxPort_P24_7,
        &IfxPort_P24_8,
        &IfxPort_P24_9,
        &IfxPort_P24_10,
        &IfxPort_P24_11,
        &IfxPort_P24_12,
        &IfxPort_P24_13,
        &IfxPort_P24_14,
        &IfxPort_P24_15
    },
    {
        &IfxPort_P25_0,
        &IfxPort_P25_1,
        &IfxPort_P25_2,
        &IfxPort_P25_3,
        &IfxPort_P25_4,
        &IfxPort_P25_5,
        &IfxPort_P25_6,
        &IfxPort_P25_7,
        &IfxPort_P25_8,
        &IfxPort_P25_9,
        &IfxPort_P25_10,
        &IfxPort_P25_11,
        &IfxPort_P25_12,
        &IfxPort_P25_13,
        &IfxPort_P25_14,
        &IfxPort_P25_15
    },
    {
        &IfxPort_P26_0,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P30_0,
        &IfxPort_P30_1,
        &IfxPort_P30_2,
        &IfxPort_P30_3,
        &IfxPort_P30_4,
        &IfxPort_P30_5,
        &IfxPort_P30_6,
        &IfxPort_P30_7,
        &IfxPort_P30_8,
        &IfxPort_P30_9,
        &IfxPort_P30_10,
        &IfxPort_P30_11,
        &IfxPort_P30_12,
        &IfxPort_P30_13,
        &IfxPort_P30_14,
        &IfxPort_P30_15
    },
    {
        &IfxPort_P31_0,
        &IfxPort_P31_1,
        &IfxPort_P31_2,
        &IfxPort_P31_3,
        &IfxPort_P31_4,
        &IfxPort_P31_5,
        &IfxPort_P31_6,
        &IfxPort_P31_7,
        &IfxPort_P31_8,
        &IfxPort_P31_9,
        &IfxPort_P31_10,
        &IfxPort_P31_11,
        &IfxPort_P31_12,
        &IfxPort_P31_13,
        &IfxPort_P31_14,
        &IfxPort_P31_15
    },
    {
        &IfxPort_P32_0,
        &IfxPort_P32_1,
        &IfxPort_P32_2,
        &IfxPort_P32_3,
        &IfxPort_P32_4,
        &IfxPort_P32_5,
        &IfxPort_P32_6,
        &IfxPort_P32_7,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P33_0,
        &IfxPort_P33_1,
        &IfxPort_P33_2,
        &IfxPort_P33_3,
        &IfxPort_P33_4,
        &IfxPort_P33_5,
        &IfxPort_P33_6,
        &IfxPort_P33_7,
        &IfxPort_P33_8,
        &IfxPort_P33_9,
        &IfxPort_P33_10,
        &IfxPort_P33_11,
        &IfxPort_P33_12,
        &IfxPort_P33_13,
        &IfxPort_P33_14,
        &IfxPort_P33_15
    },
    {
        NULL_PTR,
        &IfxPort_P34_1,
        &IfxPort_P34_2,
        &IfxPort_P34_3,
        &IfxPort_P34_4,
        &IfxPort_P34_5,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    },
    {
        &IfxPort_P40_0,
        &IfxPort_P40_1,
        &IfxPort_P40_2,
        &IfxPort_P40_3,
        &IfxPort_P40_4,
        &IfxPort_P40_5,
        &IfxPort_P40_6,
        &IfxPort_P40_7,
        &IfxPort_P40_8,
        &IfxPort_P40_9,
        &IfxPort_P40_10,
        &IfxPort_P40_11,
        &IfxPort_P40_12,
        &IfxPort_P40_13,
        &IfxPort_P40_14,
        &IfxPort_P40_15
    },
    {
        &IfxPort_P41_0,
        &IfxPort_P41_1,
        &IfxPort_P41_2,
        &IfxPort_P41_3,
        &IfxPort_P41_4,
        &IfxPort_P41_5,
        &IfxPort_P41_6,
        &IfxPort_P41_7,
        &IfxPort_P41_8,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR,
        NULL_PTR
    }
};
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
